Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V305xx.svd
      </registers>
    </peripheral>
	<peripheral>
		<name>USBHS</name>
		<description>USB register</description>
		<groupName>USBHS</groupName>
		<baseAddress>0x40023400</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>USBHSWakeup</name>
			<description>USBHSWakeup</description>
			<value>84</value>
		</interrupt>
		<interrupt>
		<name>USBHS</name>
		<description>USBHS</description>
			<value>85</value>
		</interrupt>
		<registers>
			<register>
				<name>USB_CTRL</name>
				<description>USB base control</description>
				<addressOffset>0x00</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
        <resetValue>0x06</resetValue>
				<fields>
					<field>
						<name>RB_UC_DMA_EN</name>
						<description>DMA enable and DMA interrupt enable for USB</description>
						<bitRange>[0:0]</bitRange>		
					</field>
					<field>
						<name>RB_UC_CLR_ALL</name>
						<description>force clear FIFO and count of USB</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UC_RST_SIE</name>
						<description>force reset USB SIE, need software clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UC_INT_BUSY</name>
						<description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UC_DEV_PU_EN</name>
						<description>USB device enable and internal pullup resistance enable</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UC_SPEED_TYPE</name>
						<description>enable USB low speed: 00=full speed, 01=high speed, 10 =low speed</description>
						<bitRange>[6:5]</bitRange>
					</field>
					<field>
						<name>RB_UC_HOST_MODE</name>
						<description>enable USB host mode: 0=device mode, 1=host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>UHOST_CTRL</name>
				<description>USB HOST control</description>
				<addressOffset>0x01</addressOffset>
				<size>0x08</size>
				<fields>
					<field>
						<name>RB_UH_TX_BUS_RST</name>
						<description>USB host bus reset status</description>
						<bitRange>[0:0]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>bUH_TX_BUS_SUSPENDRB_UH_TX_BUS_SUSPEND</name>
						<description>the host sends  hang sigal</description>
						<bitRange>[1:1]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UH_TX_BUS_RESUME</name>
						<description>host wake up device</description>
						<bitRange>[2:2]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UH_REMOTE_WKUP</name>
						<description>the remoke wake-up</description>
						<bitRange>[3:3]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UH_PHY_SUSPENDM</name>
						<description>USB-PHY thesuspended state the internal USB-PLL is turned off</description>
						<bitRange>[4:4]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UH_SOF_FREE</name>
						<description>the bus is idle </description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_UH_SOF_EN</name>
						<description>automatically generate the SOF packet enabling control bit </description>
						<bitRange>[7:7]</bitRange>
						<access>read-write</access>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_EN</name>
				<description>USB interrupt enable</description>
				<addressOffset>0x02</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UIE_BUS_RST__RB_UIE_DETECT</name>
						<description>enable interrupt for USB bus reset event for USB device mode;enable interrupt for USB device detected event for USB host mode</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UIE_TRANSFER</name>
						<description>enable interrupt for USB transfer completion</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIE_SUSPEND</name>
						<description>enable interrupt for USB suspend or resume event</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIE_HST_SOF</name>
						<description>indicate host SOF timer action status for USB host</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UIE_FIFO_OV</name>
						<description>enable interrupt for FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_U_1WIRE_MODE</name>
						<description>enable USB sigle wire mode overflow</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UIE_DEV_NAK</name>
						<description>enable interrupt for NAK responded for USB device mode</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_DEV_AD</name>
				<description>USB device address</description>
				<addressOffset>0x03</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_USB_ADDR</name>
						<description>bit mask for USB device address</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_FRAME_NO</name>
				<description>USB_FRAME_NO</description>
				<addressOffset>0x04</addressOffset>
				<size>0x10</size>
				<access>read-only</access>
			<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>USB_FRAME_NO</name>
						<description>USB_FRAME_NO</description>
						<bitRange>[15:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_USB_SUSPEND</name>
				<description>indicate USB suspend status</description>
				<addressOffset>0x06</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
			<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>USB_SYS_MOD</name>
						<description>USB_SYS_MOD</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USB_WAKEUP</name>
						<description>remote resume</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USB_LINESTATE</name>
						<description>USB_LINESTATE</description>
						<bitRange>[5:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_SPEED_TYPE</name>
				<description>USB_SPEED_TYPE</description>
				<addressOffset>0x08</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
			<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>USB_SPEED_TYPE</name>
						<description>USB_SPEED_TYPE</description>
						<bitRange>[1:0]</bitRange>
					</field>
					</fields>
			</register>
			
			<register>
				<name>USB_MIS_ST</name>
				<description>USB miscellaneous status</description>
				<addressOffset>0x09</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UMS_SPLIT_CAN</name>
						<description>RO, indicate device attached status on USB host</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UMS_ATTACH</name>
						<description>RO, indicate UDM level saved at device attached to USB host</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SUSPEND</name>
						<description>RO, indicate USB suspend status</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UMS_BUS_RESET</name>
						<description>RO, indicate USB bus reset status</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UMS_R_FIFO_RDY</name>
						<description>RO, indicate USB receiving FIFO ready status (not empty)</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_ACT</name>
						<description>RO, indicate host SOF timer action status for USB host</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_PRES</name>
						<description>RO, indicate host SOF timer presage status</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_FG</name>
				<description>USB interrupt flag</description>
				<addressOffset>0x0A</addressOffset>
				<size>0x08</size>
				<resetValue>0x20</resetValue>
				<fields>
					<field>
						<name>RB_UIF_BUS_RST__RB_UIF_DETECT</name>
						<description>bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear;device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear</description>
						<bitRange>[0:0]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_TRANSFER</name>
						<description>USB transfer completion interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[1:1]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_SUSPEND</name>
						<description>USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[2:2]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_HST_SOF</name>
						<description>host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear</description>
						<bitRange>[3:3]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_FIFO_OV</name>
						<description>FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear</description>
						<bitRange>[4:4]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_SETUP_ACT</name>
						<description>USB_SETUP_ACT</description>
						<bitRange>[5:5]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_UIF_ISO_ACT</name>
						<description>UIF_ISO_ACT</description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_ST</name>
				<description>USB interrupt status</description>
				<addressOffset>0x0B</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>MASK_UIS_H_RES__MASK_UIS_ENDP</name>
						<description>RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UIS_TOKEN</name>
						<description>RO, bit mask of current token PID code received for USB device mode</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UIS_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIS_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_RX_LEN</name>
				<description>USB receiving length</description>
				<addressOffset>0x0C</addressOffset>
				<size>0x10</size>
				<access>read-only</access>
        <fields>
          <field>
            <name>R16_USB_RX_LEN</name>
						<description>length of received bytes</description>
						<bitRange>[15:0]</bitRange>
          </field>
        </fields>
			</register>
			<register>
				<name>UEP_CONFIG__UHOST_CTRL</name>
				<description>USB endpoint configuration</description>
				<addressOffset>0x10</addressOffset>
				<size>0X20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>RB_UEP_T_EN__UH_EP_MOD</name>
						<description>endpoint RX enable/bUH_TX_EN</description>
						<bitRange>[31:17]</bitRange>
						<access>read-write</access>
			</field>
		    <field>
            <name>RB_UEP_T_EN_bUH_TX_EN</name>
						<description>endpoint TX enable/bUH_TX_EN</description>
						<bitRange>[15:1]</bitRange>
						<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
				<name>UEP_TYPE</name>
				<description>USB endpoint type</description>
				<addressOffset>0x14</addressOffset>
				<size>0X20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>RB_UEP_R_TYPE</name>
						<description>endpoint RX type</description>
						<bitRange>[31:17]</bitRange>
						<access>read-write</access>
			</field>
		    <field>
            <name>RB_UEP_T_TYPE</name>
						<description>endpoint TX type</description>
						<bitRange>[15:1]</bitRange>
						<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
				<name>UEP_BUF_MOD</name>
				<description>USB endpoint buffer mode</description>
				<addressOffset>0x18</addressOffset>
				<size>0X20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>RB_UEP_ISO_BUF_MOD</name>
						<description>buffer mode of USB endpoint</description>
						<bitRange>[31:16]</bitRange>
						<access>read-write</access>
			</field>
		    <field>
            <name>RB_UEP_BUF_MOD</name>
						<description>buffer mode of USB endpoint</description>
						<bitRange>[15:0]</bitRange>
						<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
				<name>UEP0_DMA</name>
				<description>B endpoint 0 DMA buffer address</description>
				<addressOffset>0x1C</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>UEP0_DMA</name>
					<description> endpoint 0 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_RX_DMA</name>
			<description>endpoint 1 DMA RX buffer address</description>
			<addressOffset>0x20</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_RX_DMA</name>
					<description> endpoint 1 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_RX_DMA__UH_RX_DMA</name>
			<description>endpoint 2 DMA RX buffer address/UH_RX_DMA</description>
			<addressOffset>0x24</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_RX_DMA__UH_RX_DMA</name>
					<description> endpoint 2 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_RX_DMA</name>
			<description>endpoint 3 DMA RX buffer address</description>
			<addressOffset>0x28</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_RX_DMA</name>
					<description> endpoint 3 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_RX_DMA</name>
			<description>endpoint 4 DMA RX buffer address</description>
			<addressOffset>0x2C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_RX_DMA</name>
					<description> endpoint 4 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_RX_DMA</name>
			<description>endpoint 5 DMA RX buffer address</description>
			<addressOffset>0x30</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_DMA</name>
					<description> endpoint 5 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_RX_DMA</name>
			<description>endpoint 6 DMA RX buffer address</description>
			<addressOffset>0x34</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_RX_DMA</name>
					<description> endpoint 6 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_RX_DMA</name>
			<description>endpoint 7 DMA RX buffer address</description>
			<addressOffset>0x38</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_RX_DMA</name>
					<description> endpoint 7 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_RX_DMA</name>
			<description>endpoint 8 DMA RX buffer address</description>
			<addressOffset>0x3C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_RX_DMA</name>
					<description> endpoint 8 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP9_RX_DMA</name>
			<description>endpoint 9 DMA RX buffer address</description>
			<addressOffset>0x40</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_RX_DMA</name>
					<description> endpoint 9 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP10_RX_DMA</name>
			<description>endpoint 10 DMA RX buffer address</description>
			<addressOffset>0x44</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_RX_DMA</name>
					<description> endpoint 10 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP11_RX_DMA</name>
			<description>endpoint 11 DMA RX buffer address</description>
			<addressOffset>0x48</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_RX_DMA</name>
					<description> endpoint 11 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_RX_DMA</name>
			<description>endpoint 12 DMA RX buffer address</description>
			<addressOffset>0x4C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_RX_DMA</name>
					<description> endpoint 12 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP13_RX_DMA</name>
			<description>endpoint 13 DMA RX buffer address</description>
			<addressOffset>0x50</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_RX_DMA</name>
					<description> endpoint 13 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP14_RX_DMA</name>
			<description>endpoint 14 DMA RX buffer address</description>
			<addressOffset>0x54</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_RX_DMA</name>
					<description> endpoint 14 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP15_RX_DMA</name>
			<description>endpoint 15 DMA RX buffer address</description>
			<addressOffset>0x58</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP15_RX_DMA</name>
					<description> endpoint 15 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_TX_DMA</name>
			<description>endpoint 1 DMA TX buffer address</description>
			<addressOffset>0X5C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_TX_DMA</name>
					<description> endpoint 1 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_TX_DMA</name>
			<description>endpoint 2 DMA TX buffer address</description>
			<addressOffset>0x60</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_TX_DMA</name>
					<description> endpoint 2 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_TX_DMA__UH_TX_DMA</name>
			<description>endpoint 3 DMA TX buffer address</description>
			<addressOffset>0x64</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_TX_DMA__UH_TX_DMA</name>
					<description> endpoint 3 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_TX_DMA</name>
			<description>endpoint 4 DMA TX buffer address</description>
			<addressOffset>0x68</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_TX_DMA</name>
					<description> endpoint 4 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_TX_DMA</name>
			<description>endpoint 5 DMA TX buffer address</description>
			<addressOffset>0x6C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_TX_DMA</name>
					<description> endpoint 5 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_TX_DMA</name>
			<description>endpoint 6 DMA TX buffer address</description>
			<addressOffset>0x70</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_TX_DMA</name>
					<description> endpoint 6 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_TX_DMA</name>
			<description>endpoint 7 DMA TX buffer address</description>
			<addressOffset>0x74</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_TX_DMA</name>
					<description> endpoint 7 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
