Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V305xx.svd
		<register>
          <name>IPRIOR140</name>
          <displayName>IPRIOR140</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR141</name>
          <displayName>IPRIOR141</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR142</name>
          <displayName>IPRIOR142</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR143</name>
          <displayName>IPRIOR143</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR144</name>
          <displayName>IPRIOR144</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x490</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR145</name>
          <displayName>IPRIOR145</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x491</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR146</name>
          <displayName>IPRIOR146</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x492</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR147</name>
          <displayName>IPRIOR147</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x493</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR148</name>
          <displayName>IPRIOR148</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x494</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR149</name>
          <displayName>IPRIOR149</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x495</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
	
			<register>
          <name>IPRIOR150</name>
          <displayName>IPRIOR150</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x496</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR151</name>
          <displayName>IPRIOR151</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x497</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR152</name>
          <displayName>IPRIOR152</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x498</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR153</name>
          <displayName>IPRIOR153</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x499</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR154</name>
          <displayName>IPRIOR154</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR155</name>
          <displayName>IPRIOR155</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR156</name>
          <displayName>IPRIOR156</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR157</name>
          <displayName>IPRIOR157</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR158</name>
          <displayName>IPRIOR158</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR159</name>
          <displayName>IPRIOR159</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

				<register>
          <name>IPRIOR160</name>
          <displayName>IPRIOR160</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR161</name>
          <displayName>IPRIOR161</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR162</name>
          <displayName>IPRIOR162</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR163</name>
          <displayName>IPRIOR163</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR164</name>
          <displayName>IPRIOR164</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR165</name>
          <displayName>IPRIOR165</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR166</name>
          <displayName>IPRIOR166</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR167</name>
          <displayName>IPRIOR167</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR168</name>
          <displayName>IPRIOR168</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR169</name>
          <displayName>IPRIOR169</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR170</name>
          <displayName>IPRIOR170</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR171</name>
          <displayName>IPRIOR171</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR172</name>
          <displayName>IPRIOR172</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR173</name>
          <displayName>IPRIOR173</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR174</name>
          <displayName>IPRIOR174</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR175</name>
          <displayName>IPRIOR175</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR176</name>
          <displayName>IPRIOR176</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR177</name>
          <displayName>IPRIOR177</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR178</name>
          <displayName>IPRIOR178</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR179</name>
          <displayName>IPRIOR179</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR180</name>
          <displayName>IPRIOR180</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR181</name>
          <displayName>IPRIOR181</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR182</name>
          <displayName>IPRIOR182</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR183</name>
          <displayName>IPRIOR183</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR184</name>
          <displayName>IPRIOR184</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR185</name>
          <displayName>IPRIOR185</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR186</name>
          <displayName>IPRIOR186</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR187</name>
          <displayName>IPRIOR187</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR188</name>
          <displayName>IPRIOR188</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR189</name>
          <displayName>IPRIOR189</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR190</name>
          <displayName>IPRIOR190</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR191</name>
          <displayName>IPRIOR191</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR192</name>
          <displayName>IPRIOR192</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR193</name>
          <displayName>IPRIOR193</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR194</name>
          <displayName>IPRIOR194</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR195</name>
          <displayName>IPRIOR195</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR196</name>
          <displayName>IPRIOR196</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR197</name>
          <displayName>IPRIOR197</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR198</name>
          <displayName>IPRIOR198</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR199</name>
          <displayName>IPRIOR199</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>	
				<register>
          <name>IPRIOR200</name>
          <displayName>IPRIOR200</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR201</name>
          <displayName>IPRIOR201</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR202</name>
          <displayName>IPRIOR202</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
				<register>
          <name>IPRIOR203</name>
          <displayName>IPRIOR203</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR204</name>
          <displayName>IPRIOR204</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR205</name>
          <displayName>IPRIOR205</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR206</name>
          <displayName>IPRIOR206</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR207</name>
          <displayName>IPRIOR207</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR208</name>
          <displayName>IPRIOR208</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR209</name>
          <displayName>IPRIOR209</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR210</name>
          <displayName>IPRIOR210</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
